import React from 'react';
import styles from './Section2.module.css';
import Image from 'next/image';
import Photo2 from './../../../public/assets/ua/photo-1@2x.jpeg';
import Photo1 from './../../../public/assets/ua/photo-1@1x.jpeg';
import Heart1 from './../../../public/assets/heart/heart1.png';
import Heart2 from './../../../public/assets/heart/heart2.png';
import Heart3 from './../../../public/assets/heart/heart-ua.png';
import HrBlockBlue from '../hrBlock/HrBlockBlue';

const Section2 = () => {
  return (
    <section id='about' className={styles.bg}>
      <div className={styles.content}>
        <h2 className='heading2'>Хто ми</h2>
        <div className='mt-5 mb-10'>
          <HrBlockBlue />
        </div>
        <div className={styles.wrapper__p}>
          <Image
            className={styles.heart1}
            src={Heart1}
            alt=''
            width={68}
            height={94}
          />
          <Image
            className={styles.heart3}
            src={Heart3}
            alt=''
            width={214}
            height={179}
          />
          <p className='p__text'>
            Благодійна організація «Благодійний фонд «Дихання сердець» є
            українською неурядовою організацією, що почала свою діяльність у
            2016 році. Основною метою фонду визначено благодійну
            діяльність/майнову допомогу для досягнення цілей визначених Статутом
            організації.
          </p>

          <Image
            className={styles.photo}
            src={Photo1}
            srcSet={Photo2}
            alt=''
            width={1110}
            height={272}
          />
          <div className='h-[493px] relative'>
            <p className='p__text'>
              Цілями фонду є: надання допомоги для сприяння законним інтересам
              набувачам благодійної діяльності, а також розвиток і підтримка цих
              сфер у суспільних інтересах. Сферами благодійної діяльності Фонду
              є: екологія, охорона довкілля, захист тварин, соціальний захист та
              забезпечення, права людини і громадянина, допомога розвитку
              територіальних громад та ін. В пріоритеті першої гуманітарної
              допомоги є ВПО, діти та люди похилого віку! Але з початком
              повномасштабного вторгнення російських військ почали активно
              допомагати ВПО та населенню на деокупованих територіях та
              прифронтових зонах. Доставляємо та забезпечуємо на деокупованих
              територіях генератори, медичні препарати які вкрай життєво
              необхідні, дитяче харчування, одяг, засоби гігієни, матеріали для
              відновлення домівок та ін. Ми маємо вдалий досвід з реалізації
              локалізації гуманітарної допомоги у вигляді гігієнічних,
              продуктових наборів, речей та ін. <br />
              <br />
              Постійно працюємо над забезпеченням та підтримкою місцевих ВПО та
              населення яке постраждало від агресора продуктами харчування для
              дорослих і дітей, засобами гігієни, одягом, медичними препаратами
              та ін.. З 8 серпня у нас була реалізація проєкту з дрібних
              ремонтів домогосподарств які постраждали внаслідок військової
              агресії у Барвінківській та Балаклійській громаді за фінансової
              підтримки acted та UHF.
              <br /> З 21 листопада і наразі реалізацуємо проєкт з дрібних
              ремонтів домогосподарств які постраждали внаслідок військової
              агресії у с.Рідне Барвінківської та с.Петрівське, Балаклійської
              громади фінансової підтримки acted, ДОСТУП до багатоцільової
              гуманітарної допомоги та Фінансується в рамках гуманітарної
              допомоги Європейського Союзу.
              <br /> Наразі триває реалізація проекту «Здорова жінка – Майбутнє
              родини» при підтримці 1325 Жінки.Мир.Безпека. Місцеві потреби –
              Місцеві рішення. Метою проекту є забезпечення ефективної
              профілактики онкозахворювання у жінок Синельниківської громади
              шляхом надання їм доступних та якісних гінекологічних послуг та
              ультразвукових досліджень.
            </p>
            <Image
              className={styles.heart2}
              src={Heart2}
              alt=''
              width={122}
              height={130}
            />
          </div>
        </div>
      </div>
    </section>
  );
};

export default Section2;
